Reports/АнализРеализация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Report>
		<Properties>
			<Name>АнализРеализация</Name>
		</Properties>
	</Report>
</MetaDataObject>

AccumulationRegisters/Реализация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<AccumulationRegister>
		<Properties>
			<Name>Реализация</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>План</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Факт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидПлана</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПланаБюджета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗадачаПроекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗадачиПроектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Договор</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ОбеспечениеОплата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>ОбеспечениеОплата</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаОбеспечено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОплачено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗадачаПроекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗадачиПроектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Договор</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Reports/АнализРеализация/Ext/ObjectModule.bsl
&НаСервере
Функция РеализацияПоЗадачеПроекта( Параметры )   Экспорт
	//Отчеты по Реализации [#129630]
	тзРеализация = Новый ТаблицаЗначений;
	тзРеализация.Колонки.Добавить("ЗадачаПроекта");
	тзРеализация.Колонки.Добавить("Договор");        
	тзРеализация.Колонки.Добавить("Организация");
	тзРеализация.Колонки.Добавить("Месяц");
	тзРеализация.Колонки.Добавить("Обеспечено");
	тзРеализация.Колонки.Добавить("Реализация");
	тзРеализация.Колонки.Добавить("Оплачено");
	
	ГодЗадач = Параметры.ГодЗадач.Значение;
	
	Если ГодЗадач = Неопределено Тогда
		Сообщить("Год задач не заданы");
		Возврат тзРеализация;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Реализация.ЗадачаПроекта,
	               |	Реализация.Договор,
	               |	Реализация.Месяц,
	               |	СУММА(Реализация.План) КАК Обеспечено,
	               |	СУММА(Реализация.Факт) КАК Реализация,
	               |	0 КАК Оплачено
	               |ИЗ
	               |	РегистрНакопления.Реализация КАК Реализация
	               |ГДЕ
	               |	Реализация.ЗадачаПроекта.ГодЗадачи = &ГодЗадач
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Реализация.ЗадачаПроекта,
	               |	Реализация.Договор,
	               |	Реализация.Месяц
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ОбеспечениеОплата.ЗадачаПроекта,
	               |	ОбеспечениеОплата.Договор,
	               |	ОбеспечениеОплата.Месяц,
	               |	0,
	               |	0,
	               |	ОбеспечениеОплата.СуммаОплачено
				   |ИЗ
	               |	РегистрНакопления.ОбеспечениеОплата КАК ОбеспечениеОплата
	               |ГДЕ
	               |	ОбеспечениеОплата.ЗадачаПроекта.ГодЗадачи = &ГодЗадач";	 
	Запрос.УстановитьПараметр("ГодЗадач", ГодЗадач);
	
	Если Параметры.ТиповыеЗадачи.Значение.Количество() > 0 Тогда
		Запрос.Текст = Запрос.Текст + " И Реализация.ЗадачаПроекта.ТиповаяЗадача В ИЕРАРХИИ(&ТиповыеЗадачи)";
		Запрос.УстановитьПараметр("ТиповыеЗадачи", Параметры.ТиповыеЗадачи.Значение);
	КонецЕсли;;
	
	Если Параметры.Организация.Значение.Количество() > 0 Тогда
		Запрос.Текст = Запрос.Текст + " И Реализация.Договор.Организация В (&ЮЛ)";
		Запрос.УстановитьПараметр("Организация", Параметры.Организация.Значение);
	КонецЕсли;;
	
	Если Параметры.СтатусыПроектов.Значение.Количество() > 0 Тогда
		Запрос.Текст = Запрос.Текст + " И Реализация.ЗадачаПроекта.Владелец.Статус В(&СтатусыПроектов)";
		Запрос.УстановитьПараметр("СтатусыПроектов", Параметры.СтатусыПроектов.Значение);
	КонецЕсли;;
		
//	Если Параметры.ТиповыеЗадачи.Значение.Количество() > 0 Тогда
//		Запрос.УстановитьПараметр("ТиповыеЗадачи", Параметры.ТиповыеЗадачи.Значение);
//	КонецЕсли;;
	
	тзРезультат = Запрос.Выполнить().Выгрузить();
	                                                     
	Для Каждого рез Из тзРезультат Цикл
		стр = тзРеализация.Добавить();
		стр.ЗадачаПроекта = рез.ЗадачаПроекта;
		стр.Месяц = рез.Месяц;
		стр.Обеспечено = рез.Обеспечено;
		стр.Реализация = рез.Реализация;
		стр.Оплачено = рез.Оплачено;
		стр.Договор = рез.Договор;
		стр.Организация = рез.Договор.Организация;
	КонецЦикла;
	
	Возврат тзРеализация;
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	//
	НастройкиСКД		= КомпоновщикНастроек.ПолучитьНастройки();
	
	//Получение самой СКД из макета
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	//Макет компоновки
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,НастройкиСКД, ДанныеРасшифровки );
	
	//Связь между таблицей значений и именами в СКД
	ВнешниеНаборыДанных = Новый Структура;
//	ВнешниеНаборыДанных.Вставить("ТаблицаДоходов", РаспределениеДоходовПоЗадачеПроекта( ЗадачаПроекта ));
	// параметры из СКД
	ВнешниеНаборыДанных.Вставить("Реализация", РеализацияПоЗадачеПроекта( МакетКомпоновки.ЗначенияПараметров ));
	
	//Компоновка данных
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,ВнешниеНаборыДанных,ДанныеРасшифровки);

	//Вывод результата
	ДокументРезультат.Очистить(); 
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	//ДокументРезультат.Показать();

	//ДокументРезультат = Новый ТабличныйДокумент;
	ДокументРезультат.АвтоМасштаб=Истина;
	ДокументРезультат.ОриентацияСтраницы=ОриентацияСтраницы.Ландшафт;
	
КонецПроцедуры
